12/data/attachments/68776432a897635d.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_b7f4e6c3-6c53-40f1-a19a-ae8fcadefb5c</nif:username>
            <nif:friendToBeAdded>Matthew_start_Friend_24599_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>